#Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
#https://drive.google.com/file/d/1WXaZG1oh7tEwHe_1qV5Ml0TC2qCV-A0J/view?usp=sharing

a = int(input('Введите номер буквы в алфавите в диапазоне чисел с 65 до 90'))

a = chr(a)

print(f'Буква: {a}')
